fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорыИРеализации</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ОказанныеУслуги</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ЗаполнитьДоговорыИРеализации(Дата) Экспорт
	
	ДоговорыИРеализации = Новый Массив;
	
	СозданиеДокументовРеализации(Дата, ДоговорыИРеализации);
	
	УчетНеоконченныхРаботПоДоговору(Дата, ДоговорыИРеализации);
	
	Возврат ДоговорыИРеализации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СозданиеДокументовРеализации(Дата, ДоговорыИРеализации)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ""Нет реализации"") КАК Реализация,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор = РеализацияТоваровУслуг.Договор
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И ВКМ_ОбслуживаниеКлиента.Проведен
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиента.Договор,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ""Нет реализации""),
		|	ВКМ_ОбслуживаниеКлиента.Клиент";
		
	Запрос.УстановитьПараметр("НачалоМесяца", Дата);
	Запрос.УстановитьПараметр("КонецМесяца", КонецДня(КонецМесяца(Дата)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.Реализация) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			ДанныеЗаполнения = Новый Структура("Дата, Договор, Клиент", КонецМесяца(Дата), Выборка.Договор, Выборка.Клиент);
			
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			ДокументОбъект.ВыполнитьАвтозаполнение();
			Если ДокументОбъект.ПроверитьЗаполнение() Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
				
			Данные = Новый Структура("Договор, Реализация", Выборка.Договор, ДокументОбъект.Ссылка);
			ДоговорыИРеализации.Добавить(Данные);
			
		Иначе
			
			Данные = Новый Структура("Договор, Реализация", Выборка.Договор, Выборка.Реализация);
			ДоговорыИРеализации.Добавить(Данные);
			
		КонецЕсли;
					
	КонецЦикла;
	
КонецПроцедуры

Процедура УчетНеоконченныхРаботПоДоговору(Дата, ДоговорыИРеализации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ""Нет реализации"") КАК Реализация,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор.Представление КАК ДоговорПредставление,
		|	ВКМ_ОбслуживаниеКлиента.Представление КАК ОбслуживаниеПредставление
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор = РеализацияТоваровУслуг.Договор
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
		|	И НЕ ВКМ_ОбслуживаниеКлиента.Проведен
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиента.Договор,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ""Нет реализации""),
		|	ВКМ_ОбслуживаниеКлиента.Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор.Представление,
		|	ВКМ_ОбслуживаниеКлиента.Представление";
	
	Запрос.УстановитьПараметр("НачалоМесяца", Дата);
	Запрос.УстановитьПараметр("КонецМесяца", КонецДня(КонецМесяца(Дата)));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	ТекстКомментария = СтрШаблон("Не завершены работы по обслуживанию клиента по договору: %1
		|Документ обслуживания: %2
		|После завершения работ стоит перезаполнить таблицу Услуги и провести документ", 
			Выборка.ДоговорПредставление, 
			Выборка.ОбслуживаниеПредставление);
		
		Если ТипЗнч(Выборка.Реализация) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			ДанныеЗаполнения = Новый Структура("Дата, Договор, Клиент", КонецМесяца(Дата), Выборка.Договор, Выборка.Клиент);
			
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	
			ДокументОбъект.Комментарий = ТекстКомментария;
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Данные = Новый Структура("Договор, Реализация", Выборка.Договор, ДокументОбъект.Ссылка);
			ДоговорыИРеализации.Добавить(Данные);
			
		Иначе
			
			ДокументОбъект = Выборка.Реализация.ПолучитьОбъект();
			ДокументОбъект.Комментарий = ТекстКомментария;
		
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
